Analise de Dados com Pandas

In [15]:
import pandas as pd

In [16]:
dataset = pd.read_csv("dados/db.csv", sep=';', index_col = 0)

In [17]:
dataset.head()

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
Jetta Variant,Motor 4.0 Turbo,2003,44410.0,False,"['Rodas de liga', 'Travas elétricas', 'Piloto ...",88078.64
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94
Crossfox,Motor Diesel V8,1990,37123.0,False,"['Piloto automático', 'Controle de estabilidad...",72832.16
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Aston Martin DB4,Motor 2.4 Turbo,2006,25757.0,False,"['Rodas de liga', '4 X 4', 'Central multimídia...",92612.10

In [18]:
dataset['Valor']

Nome
Jetta Variant             88078.64
Passat                   106161.94
Crossfox                  72832.16
DS5                      124549.07
Aston Martin DB4          92612.10
                           ...
Phantom 2013              51759.58
Cadillac Ciel concept     51667.06
Classe GLK                68934.03
Aston Martin DB5         122110.90
Macan                     90381.47
Name: Valor, Length: 258, dtype: float64

In [20]:
dataset[0:3]

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
Jetta Variant,Motor 4.0 Turbo,2003,44410.0,False,"['Rodas de liga', 'Travas elétricas', 'Piloto ...",88078.64
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94
Crossfox,Motor Diesel V8,1990,37123.0,False,"['Piloto automático', 'Controle de estabilidad...",72832.16

In [11]:
pd.read_csv("dados/db.csv", sep=";", usecols=["Nome", "Ano"]).head()

               Nome   Ano
0     Jetta Variant  2003
1            Passat  1991
2          Crossfox  1990
3               DS5  2019
4  Aston Martin DB4  2006

In [22]:
dataset.loc["DS5"]

Motor                                              Motor 2.4 Turbo
Ano                                                           2019
Quilometragem                                                  NaN
Zero_km                                                       True
Acessórios       ['Travas elétricas', '4 X 4', 'Vidros elétrico...
Valor                                                       124549
Name: DS5, dtype: object

In [23]:
dataset.loc[["DS5", "Passat"]]

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94

In [24]:
dataset.loc[["DS5", "Passat"], ["Motor","Valor"]]

                  Motor      Valor
Nome
DS5     Motor 2.4 Turbo  124549.07
Passat     Motor Diesel  106161.94

In [25]:
dataset.loc[["Jetta Variant","DS5", "Passat"], ["Motor","Valor"]]

                         Motor      Valor
Nome
Jetta Variant  Motor 4.0 Turbo   88078.64
DS5            Motor 2.4 Turbo  124549.07
Passat            Motor Diesel  106161.94

In [31]:
dataset.iloc[[3,10]]

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Ford Edge,Motor Diesel V6,2002,12859.0,False,"['Sensor crepuscular', 'Rodas de liga', 'Teto ...",71647.59

In [37]:
dataset.iloc[3:10, [2, 3,4, 5]]

,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,
DS5,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Aston Martin DB4,25757.0,False,"['Rodas de liga', '4 X 4', 'Central multimídia...",92612.10
Palio Weekend,10728.0,False,"['Sensor de estacionamento', 'Teto panorâmico'...",97497.73
A5,NaN,True,"['Câmbio automático', 'Câmera de estacionament...",56445.20
Série 3 Cabrio,77599.0,False,"['Controle de estabilidade', 'Sensor crepuscul...",112310.44
Dodge Jorney,99197.0,False,"['Vidros elétricos', 'Piloto automático', 'Tet...",120716.27
Carens,37978.0,False,"['Ar condicionado', 'Painel digital', 'Central...",76566.49

In [40]:
dataset.iloc[[3,10], [2, 3,4, 5]]

,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,
DS5,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Ford Edge,12859.0,False,"['Sensor crepuscular', 'Rodas de liga', 'Teto ...",71647.59